---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.IndexLine.Index0
source: html/b65c9199-ebc3-98ea-6ca5-b2b2f94c5f8b.htm
---
# Autodesk.Revit.DB.DirectContext3D.IndexLine.Index0 Property

The index of the line segment's first vertex.

## Syntax (C#)
```csharp
public int Index0 { get; set; }
```